---
kind: type
id: T:Autodesk.Revit.DB.LinkElementId
source: html/6e18abde-8787-9906-8576-ab0c9c5432c6.htm
---
# Autodesk.Revit.DB.LinkElementId

LinkElementId represents an element in a linked document.

## Syntax (C#)
```csharp
public class LinkElementId
```

## Remarks
The id contains two element ids:
 The id of the linked model element in host document. The id of the element in the linked model document.